In [2]:
## crea el DataFrame 
## los DataFrame en Pandas son diccionarios 
import  pandas 
df  =  pandas . DataFrame (  { 'index' :  list ( range ( 1 , 6 )), 
                        'name' :  [ 'A' ,  'B' ,  'C' ,  'D' ,  'E' ], 
                        'value' :  [ 3.03 ,  5.14 ,  0.40 ,  1.13 ,  8.25 ]}) 
df

   index name  value
0      1    A   3.03
1      2    B   5.14
2      3    C   0.40
3      4    D   1.13
4      5    E   8.25

In [3]:
## pandas.DataFrame
df.to_pickle('files/data.pickle')

In [4]:
pandas.read_pickle('files/data.pickle')

   index name  value
0      1    A   3.03
1      2    B   5.14
2      3    C   0.40
3      4    D   1.13
4      5    E   8.25

In [5]:
## Se escribe el archivo 
df.to_csv('files/data.csv',   # el nombre del archivo
          index = False)      # imprime los nombres de las filas?

## verifica el archivo creado
print(open('files/data.csv', 'r').read())

index,name,value
1,A,3.03
2,B,5.14
3,C,0.4
4,D,1.13
5,E,8.25

In [6]:
pandas.read_csv('files/data.csv')

   index name  value
0      1    A   3.03
1      2    B   5.14
2      3    C   0.40
3      4    D   1.13
4      5    E   8.25

In [7]:
## La función read_csv para leer archivos contiene otros otros parámetros importantes
pandas.read_csv('files/data.csv',  # el archivo
                    sep = ',',         # separador de campos
                    thousands = None,  # separador de miles para números
                    decimal = '.')     # separador de los decimales para números

   index name  value
0      1    A   3.03
1      2    B   5.14
2      3    C   0.40
3      4    D   1.13
4      5    E   8.25

In [8]:
## Escribe el archivo con las especificaciones de formato
df.to_csv('files/data.csv2',     # nombre del archivo
           sep = ';',            # separador de campos
           decimal = ',',        # caracter decimal
           index = False)        # imprime indice de las filas?

## Verifica el archivo creado
print(open('files/data.csv2', 'r').read())

index;name;value
1;A;3,03
2;B;5,14
3;C;0,4
4;D;1,13
5;E;8,25

In [9]:
## Lee el archivo nuevamente
pandas.read_csv('files/data.csv2',
                 sep = ';',
                 thousands = None,
                 decimal = ',')

   index name  value
0      1    A   3.03
1      2    B   5.14
2      3    C   0.40
3      4    D   1.13
4      5    E   8.25

In [10]:
## Escribe el archivo en formato .txt
df.to_csv('files/data.txt',     # nombre del archivo
          sep = ' ',            # separador de campos
          decimal = '.',        # caracter decimal
          index = False)        # imprime indice de las filas?

## verifica el archivo creado
print(open('files/data.txt', 'r').read())

index name value
1 A 3.03
2 B 5.14
3 C 0.4
4 D 1.13
5 E 8.25

In [11]:
# lee el archivo del disco
pandas.read_table('files/data.txt',
                   sep = ' ',
                   decimal = '.',
                   thousands = None)

   index name  value
0      1    A   3.03
1      2    B   5.14
2      3    C   0.40
3      4    D   1.13
4      5    E   8.25

In [12]:
# crea un archivo separado por multiples espacios en blanco.
# los nombres de las columnas están separados por comas.
text = """indexnames      valuescodes
    1john wick    2.13   10
    2mark twin    3.14   11
    3louis ng     4.34   12
    4dan brown    2.31   13
    5ann marie    4.98   14"""

with open('files/data.txt', 'w') as f:
    f.write(text)
    
## verifica el archivo creado
print(open('files/data.txt', 'r').read())

indexnames      valuescodes
    1john wick    2.13   10
    2mark twin    3.14   11
    3louis ng     4.34   12
    4dan brown    2.31   13
    5ann marie    4.98   14

In [13]:
## Lee el archivo nuevamente
pandas.read_fwf('files/data.txt', 
                colspecs = 'infer', 
                widths = [5, 9, 8, 5])

   index      names  values  codes
0      1  john wick    2.13     10
1      2  mark twin    3.14     11
2      3   louis ng    4.34     12
3      4  dan brown    2.31     13
4      5  ann marie    4.98     14

In [14]:
## Escribe el DataFrame al archivo tipo JSON
df.to_json('files/data.json')

## Verifica el archivo creado
print(open('files/data.json', 'r').read())

{"index":{"0":1,"1":2,"2":3,"3":4,"4":5},"name":{"0":"A","1":"B","2":"C","3":"D","4":"E"},"value":{"0":3.03,"1":5.14,"2":0.4,"3":1.13,"4":8.25}}

In [15]:
## Lee el archivo nuevamente
pandas.read_json('files/data.json')

   index name  value
0      1    A   3.03
1      2    B   5.14
2      3    C   0.40
3      4    D   1.13
4      5    E   8.25

In [16]:
## Convierte el DataFrame a HTML
df.to_html('files/data.html',
           index = False)

## Verifica el archivo creado
print(open('files/data.html', 'r').read())

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th>index</th>
      <th>name</th>
      <th>value</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>1</td>
      <td>A</td>
      <td>3.03</td>
    </tr>
    <tr>
      <td>2</td>
      <td>B</td>
      <td>5.14</td>
    </tr>
    <tr>
      <td>3</td>
      <td>C</td>
      <td>0.40</td>
    </tr>
    <tr>
      <td>4</td>
      <td>D</td>
      <td>1.13</td>
    </tr>
    <tr>
      <td>5</td>
      <td>E</td>
      <td>8.25</td>
    </tr>
  </tbody>
</table>

In [17]:
## Lee el archivo nuevamente
pandas.read_html('files/data.html')

[   index name  value
 0      1    A   3.03
 1      2    B   5.14
 2      3    C   0.40
 3      4    D   1.13
 4      5    E   8.25]

In [18]:
## Convierte el DataFrame a un libro de Excel
df.to_excel('files/data.xlsx',
            index = False)

In [19]:
## Lee el archivo nuevamente
pandas.read_excel('files/data.xlsx')

   index name  value
0      1    A   3.03
1      2    B   5.14
2      3    C   0.40
3      4    D   1.13
4      5    E   8.25

In [20]:
## Convierte el DataFrame a formato HF5
df.to_hdf('files/data.h5', 
          key = 'G1')

In [21]:
## Lee el archivo nuevamente aclarando que el campo clave será G1
pandas.read_hdf('files/data.h5',
                key = 'G1')

   index name  value
0      1    A   3.03
1      2    B   5.14
2      3    C   0.40
3      4    D   1.13
4      5    E   8.25

In [22]:
## Lee el archivo nuevamente
pandas.read_hdf('files/data.h5')

   index name  value
0      1    A   3.03
1      2    B   5.14
2      3    C   0.40
3      4    D   1.13
4      5    E   8.25

In [23]:
## escribe el archivo
df.to_stata('files/data.dta')

## lee el archivo
pandas.read_stata('files/data.dta')

   level_0  index name  value
0        0      1    A   3.03
1        1      2    B   5.14
2        2      3    C   0.40
3        3      4    D   1.13
4        4      5    E   8.25

In [26]:
import PyPDF2
pdfFileObj = open('files/data.pdf', 'rb')
pdfReader = PyPDF2.PdfFileReader(pdfFileObj)
pageObj = pdfReader.getPage(0)
pageObj.extractText()

ModuleNotFoundError: No module named 'PyPDF2'

"R is a programming language and software environment for  statistical computing and graphics supported by the R Foundation for Statistical Computing.[3] The R language is widely used among statisticians and data miners for developing statistical software[4] and data analysis.[5] Polls, surveys of data miners, and studies of scholarly literature databases show that R's popularity has increased substantially in recent years.[6]"

In [27]:
import scipy.io as sio
sio.savemat('files/data', {'df': df})
sio.loadmat('files/data')

{'__header__': b'MATLAB 5.0 MAT-file Platform: nt, Created on: Fri Nov 22 16:04:47 2019',
 '__version__': '1.0',
 '__globals__': [],
 'df': array([[(array([[None]], dtype=object), array([[None]], dtype=object), array([[None]], dtype=object))]],
       dtype=[('index', 'O'), ('name', 'O'), ('value', 'O')])}

In [57]:
## lee el archivo del disco.
x = pandas.read_csv('files/iris.csv',
                     sep = ',',
                     thousands = None,
                     decimal = '.')
x.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [58]:
## Se imprime el número de registros que contiene el archivo
len(x)

150

In [59]:
## Se imprime el número de columnas que contiene el dataframe
len(list(x.axes[1]))

5

In [60]:
## Se imprime el número total de datos
x.size

750

In [61]:
## Se extrae la matriz traspuesta del dataframe, es decir, las columnas ahora son cada registro y las filas las cractaerísticas de la especie. 
print(x.T.head())

                 0       1       2       3       4       5       6       7    \
sepal.length     5.1     4.9     4.7     4.6       5     5.4     4.6       5
sepal.width      3.5       3     3.2     3.1     3.6     3.9     3.4     3.4
petal.length     1.4     1.4     1.3     1.5     1.4     1.7     1.4     1.5
petal.width      0.2     0.2     0.2     0.2     0.2     0.4     0.3     0.2
variety       Setosa  Setosa  Setosa  Setosa  Setosa  Setosa  Setosa  Setosa

                 8       9      ...            140        141        142  \
sepal.length     4.4     4.9    ...            6.7        6.9        5.8
sepal.width      2.9     3.1    ...            3.1        3.1        2.7
petal.length     1.4     1.5    ...            5.6        5.1        5.1
petal.width      0.2     0.1    ...            2.4        2.3        1.9
variety       Setosa  Setosa    ...      Virginica  Virginica  Virginica

                    143        144        145        146        147  \
sepal.length        6.8        6.7        6.7        6.3        6.5
sepal.width         3.2        3.3          3        2.5          3
petal.length        5.9        5.7        5.2          5        5.2
petal.width         2.3        2.5        2.3        1.9          2
variety       Virginica  Virginica  Virginica  Virginica  Virginica

                    148        149
sepal.length        6.2        5.9
sepal.width         3.4          3
petal.length        5.4        5.1
petal.width         2.3        1.8
variety       Virginica  Virginica

[5 rows x 150 columns]

In [62]:
## Parte inicial del dataframe
print(x.head())

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [63]:
print(x.head(3))

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa

In [64]:
## Parte final del dataframe
print(x.tail())

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [65]:
## Últimos registros de la tabla
print(x.tail(3))

     sepal.length  sepal.width  petal.length  petal.width    variety
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [66]:
## Extrae el nombre de las columnas en una lista. Se debe especificar en que posición se encuentra la fila de nombres de columna
list(x.axes[1])

['sepal.length', 'sepal.width', 'petal.length', 'petal.width', 'variety']

In [67]:
## Muestra el nombre de las columnas que por defecto componen las tablas
x.columns[1]

'sepal.width'

In [68]:
## Nombres que se les da las filas. Usualmente se generan automaticamente desde 0 hasta la longitud de del dataframe
x.index

RangeIndex(start=0, stop=150, step=1)

In [69]:
## Se extrae una lista que contiene el nombre de las filas
print(list(x.index))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149]

In [74]:
## La indexacción por columnas se realiza utilizando el nombre completo de la columna como una posición
## Se muestran los 5 primeros registros de la columna Species
x['variety'].head(5)

0    Setosa
1    Setosa
2    Setosa
3    Setosa
4    Setosa
Name: variety, dtype: object

In [76]:
## Es posible indexar varias columnas con sus respectivos datos
x[['variety', 'sepal.length']].head(5)

  variety  sepal.length
0  Setosa           5.1
1  Setosa           4.9
2  Setosa           4.7
3  Setosa           4.6
4  Setosa           5.0

In [77]:
## Otra forma de obtener una columna
x.get('variety').head()

0    Setosa
1    Setosa
2    Setosa
3    Setosa
4    Setosa
Name: variety, dtype: object

In [78]:
## Es posible tener acceso a la columna a través del operador '.'
x.variety.head()

0    Setosa
1    Setosa
2    Setosa
3    Setosa
4    Setosa
Name: variety, dtype: object

In [79]:
## El simbolo ':' en la primera posición significa que se obtienen todas las filas  
x.loc[:,['variety']].head()

  variety
0  Setosa
1  Setosa
2  Setosa
3  Setosa
4  Setosa

In [80]:
## La misma salida anterior pero con loc
x.loc[:].variety.head()

0    Setosa
1    Setosa
2    Setosa
3    Setosa
4    Setosa
Name: variety, dtype: object

In [81]:
x.loc[:]['variety'].head()

0    Setosa
1    Setosa
2    Setosa
3    Setosa
4    Setosa
Name: variety, dtype: object

In [82]:
## Accede a la segunda fila
x.loc[2]

sepal.length       4.7
sepal.width        3.2
petal.length       1.3
petal.width        0.2
variety         Setosa
Name: 2, dtype: object

In [83]:
## Accede al dato de Species y Sepal_Length de la segunda fila
x.loc[2, ['variety', 'sepal.length']]

variety         Setosa
sepal.length       4.7
Name: 2, dtype: object

In [84]:
key = ['case_{}'.format(n) for n in range(150)]
key[0:5]

['case_0', 'case_1', 'case_2', 'case_3', 'case_4']

In [85]:
## Se cambian los nombres de las filas
x.index = key
x.head()

        sepal.length  sepal.width  petal.length  petal.width variety
case_0           5.1          3.5           1.4          0.2  Setosa
case_1           4.9          3.0           1.4          0.2  Setosa
case_2           4.7          3.2           1.3          0.2  Setosa
case_3           4.6          3.1           1.5          0.2  Setosa
case_4           5.0          3.6           1.4          0.2  Setosa

In [86]:
## Selección por nombre de la fila
x.loc['case_2']

sepal.length       4.7
sepal.width        3.2
petal.length       1.3
petal.width        0.2
variety         Setosa
Name: case_2, dtype: object

In [87]:
## Selección por nombre de la fila
x.loc[['case_2', 'case_4']]

        sepal.length  sepal.width  petal.length  petal.width variety
case_2           4.7          3.2           1.3          0.2  Setosa
case_4           5.0          3.6           1.4          0.2  Setosa

In [89]:
## Selección por nombres de fila y columna
x.loc[['case_2'], ['sepal.length']]

        sepal.length
case_2           4.7

In [90]:
x.loc['case_2', 'sepal.length']

4.7

In [91]:
## selección por nombres de fila y columna
x.loc[['case_2', 'case_4'], ['sepal.length', 'sepal.width']]

        sepal.length  sepal.width
case_2           4.7          3.2
case_4           5.0          3.6

In [92]:
## Vuelve al indice por defecto
## Convierte el indice en una columna
x = x.reset_index()
x.head()

    index  sepal.length  sepal.width  petal.length  petal.width variety
0  case_0           5.1          3.5           1.4          0.2  Setosa
1  case_1           4.9          3.0           1.4          0.2  Setosa
2  case_2           4.7          3.2           1.3          0.2  Setosa
3  case_3           4.6          3.1           1.5          0.2  Setosa
4  case_4           5.0          3.6           1.4          0.2  Setosa

In [93]:
## Se elimina la columna index
del x['index']
x.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [94]:
## Selección de las primeras tres columnas
x.iloc[[0, 1, 2]].head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa

In [95]:
## Selección de las primeras tres columnas
x.iloc[:,list(range(0, 3))].head()

   sepal.length  sepal.width  petal.length
0           5.1          3.5           1.4
1           4.9          3.0           1.4
2           4.7          3.2           1.3
3           4.6          3.1           1.5
4           5.0          3.6           1.4

In [96]:
## selección de las últimas tres columnas
n = len(list(x.axes[1]))
x.iloc[:,list(range(n-3, n))].head()

   petal.length  petal.width variety
0           1.4          0.2  Setosa
1           1.4          0.2  Setosa
2           1.3          0.2  Setosa
3           1.5          0.2  Setosa
4           1.4          0.2  Setosa

In [97]:
## Selección de algunas columnas
x.iloc[:,[0,4]].head()

   sepal.length variety
0           5.1  Setosa
1           4.9  Setosa
2           4.7  Setosa
3           4.6  Setosa
4           5.0  Setosa

In [98]:
## Selección de las primeras 3 filas
x[:3]

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa

In [99]:
## Sesde la tercera hasta la última fila
x[3:].head()

   sepal.length  sepal.width  petal.length  petal.width variety
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa
5           5.4          3.9           1.7          0.4  Setosa
6           4.6          3.4           1.4          0.3  Setosa
7           5.0          3.4           1.5          0.2  Setosa

In [100]:
## Selección por intervalos
print( x[::15] )

     sepal.length  sepal.width  petal.length  petal.width     variety
0             5.1          3.5           1.4          0.2      Setosa
15            5.7          4.4           1.5          0.4      Setosa
30            4.8          3.1           1.6          0.2      Setosa
45            4.8          3.0           1.4          0.3      Setosa
60            5.0          2.0           3.5          1.0  Versicolor
75            6.6          3.0           4.4          1.4  Versicolor
90            5.5          2.6           4.4          1.2  Versicolor
105           7.6          3.0           6.6          2.1   Virginica
120           6.9          3.2           5.7          2.3   Virginica
135           7.7          3.0           6.1          2.3   Virginica

In [101]:
## Orden inverso
print( x[::-1].head() )

     sepal.length  sepal.width  petal.length  petal.width    variety
149           5.9          3.0           5.1          1.8  Virginica
148           6.2          3.4           5.4          2.3  Virginica
147           6.5          3.0           5.2          2.0  Virginica
146           6.3          2.5           5.0          1.9  Virginica
145           6.7          3.0           5.2          2.3  Virginica

In [102]:
## Todas las filas excepto la última
x[:-1].tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
144           6.7          3.3           5.7          2.5  Virginica
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica

In [103]:
## El campo que se encuentra en la fila 2 y columna 3
x.iloc[2, 3]

0.2

In [104]:
## valores para una fila particular
x.loc[[2]]

   sepal.length  sepal.width  petal.length  petal.width variety
2           4.7          3.2           1.3          0.2  Setosa

In [105]:
## indices como vector
x.iloc[[1, 3, 5]]

   sepal.length  sepal.width  petal.length  petal.width variety
1           4.9          3.0           1.4          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
5           5.4          3.9           1.7          0.4  Setosa

In [106]:
## indices como vector
x.iloc[[1, 3, 5],[0, 4]]

   sepal.length variety
1           4.9  Setosa
3           4.6  Setosa
5           5.4  Setosa

In [107]:
## Acceso rapido a un elemento
x.at[0, 'sepal.length']

5.1

In [111]:
## selección condicional. Retorna True si la condición se cumple y False si no la cumple.
(x['variety'] == 'Virginica').head()

0    False
1    False
2    False
3    False
4    False
Name: variety, dtype: bool

In [110]:
## Al realizar el filtro con loc, se accede a los elementos que cumplen con la condición
x.loc[x['variety'] == 'Virginica'].head()

     sepal.length  sepal.width  petal.length  petal.width    variety
100           6.3          3.3           6.0          2.5  Virginica
101           5.8          2.7           5.1          1.9  Virginica
102           7.1          3.0           5.9          2.1  Virginica
103           6.3          2.9           5.6          1.8  Virginica
104           6.5          3.0           5.8          2.2  Virginica

In [112]:
## El método `isin()` determina si un dato en particular se encuentra dentro del set
w = x['variety'].isin(['Virginica'])
w.head()

0    False
1    False
2    False
3    False
4    False
Name: variety, dtype: bool

In [113]:
# Selecciona los elementos que cumplieron con la condición anterior
x[w].head()

     sepal.length  sepal.width  petal.length  petal.width    variety
100           6.3          3.3           6.0          2.5  Virginica
101           5.8          2.7           5.1          1.9  Virginica
102           7.1          3.0           5.9          2.1  Virginica
103           6.3          2.9           5.6          1.8  Virginica
104           6.5          3.0           5.8          2.2  Virginica

In [116]:
## Selección condicional
x.loc[x['petal.length'] > 3.2].head()

    sepal.length  sepal.width  petal.length  petal.width     variety
50           7.0          3.2           4.7          1.4  Versicolor
51           6.4          3.2           4.5          1.5  Versicolor
52           6.9          3.1           4.9          1.5  Versicolor
53           5.5          2.3           4.0          1.3  Versicolor
54           6.5          2.8           4.6          1.5  Versicolor

In [117]:
## Conteo de casos
x['variety'].value_counts()

Setosa        50
Virginica     50
Versicolor    50
Name: variety, dtype: int64